[Killed] StringLiteral
main/components/HelpRequests/HelpRequestsTable.js:54:17
     },
     {
       Header: "Request Time (in UTC)",
-      accessor: "requestTime",
+      accessor: "",
     },
     {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requestTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/HelpRequests/HelpRequestsTable.js:62:17
     },
     {
       Header: "Solved",
-      accessor: (row) => (row.solved ? "Yes" : "No"),
+      accessor: () => undefined,
       id: "solved",
     },
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  No
Received:
