[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestsCreatePage.js:8:16
 import { toast } from "react-toastify";
 
 export default function HelpRequestsCreatePage({ storybook = false }) {
-  const addZ = (timeString) => `${timeString}Z`;
+  const addZ = () => undefined;
 
   const objectToAxiosParams = (helpRequest) => ({
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "explanation": "Need help with testing",
-   "requestTime": "2025-05-04T14:30:12.000Z",

[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestsCreatePage.js:10:31
 export default function HelpRequestsCreatePage({ storybook = false }) {
   const addZ = (timeString) => `${timeString}Z`;
 
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: addZ(helpRequest.requestTime),
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsCreatePage.js:23:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New help request created - id: ${helpRequest.id}, requester: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New help request created - id: 17, requester: linghe@ucsb.edu"

Number of calls: 0
