[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestsEditPage.js:27:34
     },
   );
 
-  const objectToAxiosPutParams = (helpRequest) => ({
-    url: "/api/helprequests",
-    method: "PUT",
-    params: {
-      id: helpRequest.id,
-    },
-    data: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime + "Z",
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestsEditPage tests backend works normally is populated with the backend data and updates on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "HelpRequest Updated - id: 17, requester: updated@ucsb.edu"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsEditPage.js:37:46
       requesterEmail: helpRequest.requesterEmail,
       teamId: helpRequest.teamId,
       tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime + "Z",
+      requestTime: helpRequest.requestTime + "",
       explanation: helpRequest.explanation,
       solved: helpRequest.solved,
killedBy: HelpRequestsEditPage tests backend works normally is populated with the backend data and updates on submit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"requesterEmail\":\"updated@ucsb.edu\",\"teamId\":\"11\",\"tableOrBreakoutRoom\":\"8\",\"requestTime\":\"2025-05-01T12:00:00Z\",\"explanation\":\"Updated explanation\",\"solved\":true}"
Received: "{\"requesterEmail\":\"updated@ucsb.edu\",\"teamId\":\"11\",\"tableOrBreakoutRoom\":\"8\",\"requestTime\":\"2025-05-01T12:00:00\"

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsEditPage.js:43:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `HelpRequest Updated - id: ${helpRequest.id}, requester: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestsEditPage tests backend works normally is populated with the backend data and updates on submit
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
