[Killed] StringLiteral
src/main/utils/helpRequestsUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/helprequests",
+    url: "",
     method: "DELETE",
     params: {
killedBy: HelpRequestsIndexPage tests delete button works for admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "HelpRequest with id 1 was deleted"
Received: "Axios Error: Error: Request failed with status code 404"

Ignored nodes: comments, script, style
<html>
  <head />
