[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:135:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.localDateTime && "Date Added is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Added is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:135:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.localDateTime && "Date Added is required. "}
+          {errors.localDateTime || "Date Added is required. "}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
