[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:60:15
       accessor: "email",
     },
     {
-      Header: "Date Added (iso format)",
+      Header: "",
       accessor: "dateAdded",
     },
killedBy: ArticlesTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Added (iso format). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="ta

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:61:17
     },
     {
       Header: "Date Added (iso format)",
-      accessor: "dateAdded",
+      accessor: "",
     },
   ];
killedBy: ArticlesTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-dateAdded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
