[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      localDateTime: article.localDateTime,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
   //
   const onSuccess = (article) => {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.js:11:13
   const objectToAxiosParams = (article) => ({
     url: "/api/articles/post",
     method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      localDateTime: article.localDateTime,
-    },
+    params: {},
   });
   //
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "email": "junjieliu@ucsb.edu",
-   "explanation": "OwO",

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:20:34
     },
   });
   //
-  const onSuccess = (article) => {
-    toast(`New article Created - id: ${article.id} title: ${article.title}`);
-  };
+  const onSuccess = (article) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New article Created - id: 1 title: owo"

Number of calls: 0
