[Killed] BooleanLiteral
main/pages/Articles/ArticlesEditPage.js:8:56
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 //
-export default function ArticlesEditPage({ storybook = false }) {
+export default function ArticlesEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/articles"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (article) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: {
-      id: article.id,
-    },
-    data: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      localDateTime: article.localDateTime,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (article) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Article Updated - id: 17 title: owo"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:34:11
     params: {
       id: article.id,
     },
-    data: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      localDateTime: article.localDateTime,
-    },
+    data: {},
   });
 
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"title\":\"DONT MAKE ME DO THIS\",\"url\":\"https://example.com\",\"explanation\":\"I cry\",\"email\":\"junjieliu@gmail.com\",\"localDateTime\":\"2024-01-01T12:00\"}"
Received: "{}"
