[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationForm.js:22:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "RecommendationForm";
+  const testIdPrefix = "";
 
   // Stryker disable Regex
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RecommendationForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationForm.js:51:42
           id="requesterEmail"
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
-          {...register("requesterEmail", {
-            required: "Requester Email is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length has 255 characters",
-            },
-          })}
+          {...register("requesterEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Requester Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationForm.js:93:24
           isInvalid={Boolean(errors.explanation)}
           {...register("explanation", {
             required: "Explanation is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length has 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: RecommendationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length has 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
