[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationTable.js:63:5
       Header: "Date Needed",
       accessor: "dateNeeded",
     },
-    {
-      Header: "Done",
-      accessor: "done",
-      Cell: ({ value }) => (value === true || value === "true" ? "Yes" : "No"),
-    },
+    {},
   ];
 
killedBy: RecommendationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Survived] ConditionalExpression
main/components/RecommendationRequests/RecommendationTable.js:66:47
     {
       Header: "Done",
       accessor: "done",
-      Cell: ({ value }) => (value === true || value === "true" ? "Yes" : "No"),
+      Cell: ({ value }) => (value === true || false ? "Yes" : "No"),
     },
   ];

[Survived] BooleanLiteral
main/components/RecommendationRequests/RecommendationTable.js:66:39
     {
       Header: "Done",
       accessor: "done",
-      Cell: ({ value }) => (value === true || value === "true" ? "Yes" : "No"),
+      Cell: ({ value }) => (value === false || value === "true" ? "Yes" : "No"),
     },
   ];
