[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestCreatePage.js:21:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New recommendation request Created - id: ${recommendationRequest.id} Requester Email: ${recommendationRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendation request Created - id: 1 Requester Email: test_email"

Number of calls: 0

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestCreatePage.js:23:7
 
   const onSuccess = (recommendationRequest) => {
     toast(
-      `New recommendation request Created - id: ${recommendationRequest.id} Requester Email: ${recommendationRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendation request Created - id: 1 Requester Email: test_email"
Received: ""

Number of calls: 1
