[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestEditPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/recommendationrequests?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/recommendationrequests`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RecommendationForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/recommendationrequests`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RecommendationForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestEditPage.js:44:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `Recommendation Request Updated - id: ${recommendationRequest.id} Requester Email: ${recommendationRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/pages/RecommendationRequests/RecommendationRequestEditPage.js:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequest && (
-          <RecommendationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequest}
-          />
-        )}
+        {recommendationRequest || <RecommendationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={recommendationRequest} />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, requesterEmail, professorEmail, explanation, dateRequested, dateNeeded, done}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/RecommendationRequests/RecommendationRequestEditPage.js:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationRequest && (
-          <RecommendationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequest}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RecommendationForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
