[Killed] StringLiteral
main/components/MenuItemReviews/ReviewForm.js:16:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "ReviewForm";
+  const testIdPrefix = "";
 
   return (
killedBy: ReviewForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="ReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
